exampleCases/bubbleGapToriorg/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (0    0 -0.001)
    (3000 0 -3.001)
    
    (0    5 -0.001)
    (3000 5 -3.001)
    
    (0    0 0.001)
    (3000 0 3.001)
    
    (0    5 0.001)
    (3000 5 3.001)
    
    (0    -250 -0.001)
    (3000 -250 -3.001)
    
    (0    -150 -0.001)
    (3000 -150 -3.001)
    
    (0    -250 0.001)
    (3000 -250 3.001)
    
    (0    -150 0.001)
    (3000 -150 3.001)
);

blocks
(
    hex (0 1 3 2 4 5 7 6)        (3000 5 1) simpleGrading (1 1 1)
    hex (8 9 11 10 12 13 15 14)   (1500 50 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    symmetryPlane left
    (
        (0 2 6 4)
        (8 10 14 12)
    )
    patch outlet
    (
        (8 9 13 12)
        (1 3 7 5)
        (9 11 15 13)
    )
    wedge front
    (
        (0 1 3 2)
        (8 9 11 10)
    )
    wedge back
    (
        (4 5 7 6)
        (12 13 15 14)
    )
    wall interface
    (
        (0 1 5 4)
        (10 11 15 14)
    )
    symmetryPlane top
    (
        (2 3 7 6)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
