exampleCases/bubbleGapToriorg/fluid/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (0    -150 -0.001)
    (3000 -150 -3.001)
    
    (0    0 -0.001)
    (3000 0 -3.001)
    
    (0    -150 0.001)
    (3000 -150 3.001)
    
    (0    0 0.001)
    (3000 0 3.001)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (3000 150 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall interface
    (
        (2 3 7 6)
        (0 1 5 4)
    )
    patch left
    (
        (0 2 6 4)
    )
    wedge front
    (
        (0 1 3 2)
    )
    wedge back
    (
        (4 5 7 6)
    )
    wall wall
    (
    )
    wall right
    (
        (1 3 7 5)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
