exampleCases/bubbleGapToriorg/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     CavBubbleFsiFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500e-9;

deltaT          1e-10;

writeControl    adjustableRunTime;

writeInterval   2e-9;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;

functions
(
   forces
   {
       type                forces;
       functionObjectLibs  ( "libforces.so" );
       outputControl       timeStep;
       outputInterval      1;
       patches             (interface);
       pName               p;
       UName               U;
       rhoName             rhoInf;
       log                 true;
       rhoInf              1000;
       CofR                (0.5 0.1 0);
   }

);


// ************************************************************************* //
