exampleCases/bubbleGapToriorg/fluid/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    D
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0.1;
    }
}

relaxationFactors
{
    fields
    {
        D 0.5;
    }

    equations
    {
        // D 1;
    }
}

// ************************************************************************* //
